<a href="https://colab.research.google.com/github/Mrsth/Pandas_practice/blob/master/Data_filling.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np
from numpy import random

In [19]:
dict1 = {
    "DATE": pd.date_range(start='2020-1-10', end='2020-1-16'),
    "ROLL_NO": [100, None ,300, None ,500,None,700],
    "NAME": ["Ram", "Shyam", None, "Gita", "Rita", None, "Tina"],
    "ADDRESS": ["Dallu", None, "Chaunni", None, "Kimdol", None, "Chagal"]
}

df1 = pd.DataFrame(dict1)
df1

        DATE  ROLL_NO   NAME  ADDRESS
0 2020-01-10    100.0    Ram    Dallu
1 2020-01-11      NaN  Shyam     None
2 2020-01-12    300.0   None  Chaunni
3 2020-01-13      NaN   Gita     None
4 2020-01-14    500.0   Rita   Kimdol
5 2020-01-15      NaN   None     None
6 2020-01-16    700.0   Tina   Chagal

In [20]:
df1.isna().sum()

DATE       0
ROLL_NO    3
NAME       2
ADDRESS    3
dtype: int64

# **Dropping the Nan values**

In [21]:
df2 = df1.dropna()
df2

        DATE  ROLL_NO  NAME ADDRESS
0 2020-01-10    100.0   Ram   Dallu
4 2020-01-14    500.0  Rita  Kimdol
6 2020-01-16    700.0  Tina  Chagal

In [ ]:
df3 = df1.dropna(axis = "rows", how="any")
df3
# how = "all" will remove only the rows with all Null values.
# how = "any" will remove all the rows containing atleast one Null value.

        DATE  ROLL_NO  NAME ADDRESS
0 2020-01-10    100.0   Ram   Dallu
4 2020-01-14    500.0  Rita  Kimdol
6 2020-01-16    700.0  Tina  Chagal

# **Filling the Nan Values**

In [27]:
df1

        DATE  ROLL_NO   NAME  ADDRESS
0 2020-01-10    100.0    Ram    Dallu
1 2020-01-11      NaN  Shyam     None
2 2020-01-12    300.0   None  Chaunni
3 2020-01-13      NaN   Gita     None
4 2020-01-14    500.0   Rita   Kimdol
5 2020-01-15      NaN   None     None
6 2020-01-16    700.0   Tina   Chagal

In [28]:
df4 = df1.fillna({
    "ROLL_NO": 0,
    "NAME": "Unknown",
    "ADDRESS": "Unknown"
})

In [29]:
df4

        DATE  ROLL_NO     NAME  ADDRESS
0 2020-01-10    100.0      Ram    Dallu
1 2020-01-11      0.0    Shyam  Unknown
2 2020-01-12    300.0  Unknown  Chaunni
3 2020-01-13      0.0     Gita  Unknown
4 2020-01-14    500.0     Rita   Kimdol
5 2020-01-15      0.0  Unknown  Unknown
6 2020-01-16    700.0     Tina   Chagal

# **Forward fill**

In [31]:
df5 = df1.fillna(method="ffill")
df5

        DATE  ROLL_NO   NAME  ADDRESS
0 2020-01-10    100.0    Ram    Dallu
1 2020-01-11    100.0  Shyam    Dallu
2 2020-01-12    300.0  Shyam  Chaunni
3 2020-01-13    300.0   Gita  Chaunni
4 2020-01-14    500.0   Rita   Kimdol
5 2020-01-15    500.0   Rita   Kimdol
6 2020-01-16    700.0   Tina   Chagal

# **Backwardfill**

In [32]:
df6 = df1.fillna(method="bfill")
df6

        DATE  ROLL_NO   NAME  ADDRESS
0 2020-01-10    100.0    Ram    Dallu
1 2020-01-11    300.0  Shyam  Chaunni
2 2020-01-12    300.0   Gita  Chaunni
3 2020-01-13    500.0   Gita   Kimdol
4 2020-01-14    500.0   Rita   Kimdol
5 2020-01-15    700.0   Tina   Chagal
6 2020-01-16    700.0   Tina   Chagal

In [33]:
df1

        DATE  ROLL_NO   NAME  ADDRESS
0 2020-01-10    100.0    Ram    Dallu
1 2020-01-11      NaN  Shyam     None
2 2020-01-12    300.0   None  Chaunni
3 2020-01-13      NaN   Gita     None
4 2020-01-14    500.0   Rita   Kimdol
5 2020-01-15      NaN   None     None
6 2020-01-16    700.0   Tina   Chagal

# **Forward fill with limit**

In [34]:
df7 = df1.fillna(method="ffill",limit=1) #Copies the valueonly one times.
# If there are 2 or more Nan values repeatedly then limit=1 will not work for filling the Nan values since it copies the values of previous not null value only once.
df7

        DATE  ROLL_NO   NAME  ADDRESS
0 2020-01-10    100.0    Ram    Dallu
1 2020-01-11    100.0  Shyam    Dallu
2 2020-01-12    300.0  Shyam  Chaunni
3 2020-01-13    300.0   Gita  Chaunni
4 2020-01-14    500.0   Rita   Kimdol
5 2020-01-15    500.0   Rita   Kimdol
6 2020-01-16    700.0   Tina   Chagal

# **Backward fill with limit**

In [35]:
df8 = df1.fillna(method="bfill", limit=1)
df8

        DATE  ROLL_NO   NAME  ADDRESS
0 2020-01-10    100.0    Ram    Dallu
1 2020-01-11    300.0  Shyam  Chaunni
2 2020-01-12    300.0   Gita  Chaunni
3 2020-01-13    500.0   Gita   Kimdol
4 2020-01-14    500.0   Rita   Kimdol
5 2020-01-15    700.0   Tina   Chagal
6 2020-01-16    700.0   Tina   Chagal